OpenFOAM/QHDFoam/QHDFoam-OFv2012/cases/cavity/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.1;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoQGDThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;//eConst
    equationOfState rhoConst;//perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

// Note: these are the properties for fuel

mixture
{
    specie
    {
        nMoles          1;
        molWeight       28.96;
    }

    
    thermodynamics
    {
        Hf              0;
        Sf              0;
        Cp              1005;
        Cv              1004;
    }
    
    equationOfState
    {
	rho	1000;
    }
    
    transport
    {
        mu   1;
        Pr   0.73;
        beta 0.0;
    }
}

QGD
{
    implicitDiffusion true;
    QGDCoeffs constTau;
    constTauDict
    {
       Tau	1e-3;
    }
    pRefCell	0;
    pRefValue	0;
}
